routes/web.php

    Session::forget('menu');
    // Store Session for Home Menu Active
    Session::put('menu', 'home');
    $p = Product::where('is_approved', 1)->where('is_active', 1)->get();
    $c = Company::where('is_approved', 1)->where('is_active', 1)->get();
    $e = Event::where('is_approved', 1)->where('is_active', 1)->get();
---
select * from `products` where `is_approved` = 1 and `is_active` = 1
select * from `companies` where `is_approved` = 1 and `is_active` = 1
select * from `events` where `is_approved` = 1 and `is_active` = 1

// If the retrieved categories are less than six, fetch additional categories as needed.
    $remainingCategoriesCount = 6 - $categories->count();
    if ($remainingCategoriesCount > 0) {
        $remainingCategories = Category::where('is_active', 1)
            ->whereIn('type', ['company', 'product', 'event', 'blog', 'job', 'forum'])
            ->orderByDesc('is_featured')
            ->orderByDesc(function ($query) {
                $query->selectRaw('COUNT(*)')
                    ->from('products')
                    ->whereColumn('categories.id', 'products.category_id');
            })
            ->take($remainingCategoriesCount)
            ->get();
---
select * from `categories` where `is_active` = 1 and `type` in ('company', 'product', 'event', 'blog', 'job', 'forum') order by `is_featured` desc, (select COUNT(*) from `products` where `categories`.`id` = `products`.`category_id`) desc limit 5


});

Route::get('direct-message', function (Request $request) {
    $request->validate([
        'company_id' => 'required',
    ]);
    $company = Company::findOrFail($request->company_id);
    $data = compact('company');
    return view('dm')->with($data);
})->name('direct-message');
---
select * from `companies` where `companies`.`id` = '5' limit 1