app/classes/HelperFunctions.php

select * from `rate_reviews` where `type` = 'company' and `item_id` = 1
---
    public static function getRatingCount($type, $id): int
    {
        try {
            $rating = RateReview::where('type', $type)->where('item_id', $id)->get();

select * from `rate_reviews` where `type` = 'company' and `item_id` = 1
---
    public static function getRatingAverage($type, $id): float
    {
        try {
            $rating = RateReview::where('type', $type)->where('item_id', $id)->get();