app/Http/Controllers/APIController.php

select * from `deals` where `is_active` = 1
---
    public function searchDeals(Request $request)
    {
        $search = $this->searchModuleValidation($request);
        $deals = Deal::where('is_active', 1)->get();

select * from `events` where `is_approved` = 1 and `is_active` = 1
---
    public function searchEvents(Request $request)
    {
        $search = $this->searchModuleValidation($request);
        $events = Event::where('is_approved', 1)->where('is_active', 1)->get();