app/Http/Controllers/UserForumController.php

select * from `categories` where `type` = 'forum' and `is_active` = 1
select * from `countries`
---
            });
        }
        $forums = $forumQuery->paginate(12);
        $categories = Category::where('type', 'forum')->where('is_active', 1)->get();
        $countries = Country::all();
        $data = compact('forums', 'categories', 'countries');
        return view('pages.forum.list')->with($data);