app/Http/Controllers/UserDealController.php

select * from `categories` where `is_active` = 1 and `type` = 'deal'
---
        $deals = $query->paginate(12);

        // Fetch categories
        $categories = Category::where('is_active', 1)->where('type', 'deal')->get();

select * from `countries`
---
        $seo = Deal::where('is_active', 1)->inRandomOrder()->limit(6)->get()->pluck('seo');
        $countries = Country::all();
        $data = compact('categories', 'deals', 'seo', 'countries');
        return view('pages.deals.list')->with($data);

select * from `deals` where `slug` = 'sint-sapiente-qui-quis-ex-possimus-in' limit 1
select * from `deals` where `category_id` = 31 and `is_active` = 1 and `id` != 41 order by RAND() limit 6
---
    public function viewDealDetails($slug)
    {
        // Forgot session
        Session::forget('menu');
        $deal = Deal::where('slug', $slug)->firstOrFail();
        // Get Related deals based on the category
        $related_deals = Deal::where('category_id', $deal->category_id)->where('is_active', 1)->where('id', '!=', $deal->id)->inRandomOrder()->limit(6)->get();
        $data = compact('deal', 'related_deals');
        return view('pages.deals.detail')->with($data);