app/Http/Controllers/UserBlogController.php

select * from `categories` where `type` = 'blog' and `is_active` = 1
---
        }

        $blogs = $blogsQuery->paginate(12);
        $categories = Category::where('type', 'blog')->where('is_active', 1)->get();

select * from `blogs` where `slug` = 'quas-itaque-odio-eaque-quia-voluptatem-sed' and `is_approved` = 1 and `is_active` = 1 limit 1
select * from `blogs` where `category_id` = 16 and `is_approved` = 1 and `is_active` = 1 and `id` != 9
---
    public function viewBlogDetails($slug)
    {
        // Forgot session
        Session::forget('menu');

        $blog = Blog::where('slug', $slug)->where('is_approved', 1)->where('is_active', 1)->firstOrFail();
        $related_blogs = Blog::where('category_id', $blog->category_id)->where('is_approved', 1)->where('is_active', 1)->where('id', '!=', $blog->id)->get();
        $data = compact('blog', 'related_blogs');
        return view('pages.blogs.detail')->with($data);