app/Http/Controllers/UserCompanyController.php

select * from `categories` where `name` = 'Smart Solutions Group' and `type` = 'company' limit 1
---
        // Filter by Category
        if ($request->has('category')) {
            // Get Category ID from Category Name
            $category = Category::where('name', $request->category)->where('type', 'company')->first();

select * from `categories` where `type` = 'company' and `is_active` = 1
---
        $seo = Company::where('is_approved', 1)->inRandomOrder()->limit(6)->get()->pluck('seo');

        // Fetch categories
        $categories = Category::where('type', 'company')->where('is_active', 1)->get();

select * from `companies` where `slug` = 'wellness-wisdom' limit 1
---
    public function viewCompanyDetails($slug)
    {
        // Forgot session
        Session::forget('menu');
        $company = Company::where('slug', $slug)->firstOrFail();