app/Http/Controllers/UserEventController.php

select * from `categories` where `type` = 'event' and `is_active` = 1
select * from `countries`
---
            $eventQuery->where('category_id', $cat_id->id);
        }
        $events = $eventQuery->paginate(12);
        $categories = Category::where('type', 'event')->where('is_active', 1)->get();
        $seo = Event::where('is_approved', 1)->where('is_active', 1)->inRandomOrder()->limit(6)->get()->pluck('seo');
        $countries = Country::all();
        $data = compact('events', 'categories', 'seo', 'countries');
        return view('pages.event.list')->with($data);

select count(*) as aggregate from `events` inner join `seo` on `events`.`seo_id` = `seo`.`id` inner join `companies` as `co` on `events`.`company_id` = `co`.`id` where `co`.`is_approved` = 1 and `co`.`is_active` = 1 and `events`.`is_active` = 1 and `events`.`is_approved` = 1
select * from `events` where `slug` = 'ab-sapiente-dolorem-amet-et-quis-at' and `is_approved` = 1 and `is_active` = 1 limit 1
---
    public function viewEventDetails($slug)
    {
        // Forgot session
        Session::forget('menu');

        $event = Event::where('slug', $slug)->where('is_approved', 1)->where('is_active', 1)->firstOrFail();
        $related_events = Event::where('category_id', $event->category_id)->where('is_approved', 1)->where('is_active', 1)->where('id', '!=', $event->id)->get();
        $data = compact('event', 'related_events');
        return view('pages.event.detail')->with($data);