app/Http/Controllers/UserJobController.php

select * from `categories` where `type` = 'job' and `is_active` = 1
---
        }

        $jobs = $jobsQuery->paginate(12);
        $categories = Category::where('type', 'job')->where('is_active', 1)->get();

select * from `countries`
---
        $seo = Job::where('is_approved', 1)->inRandomOrder()->limit(6)->get()->pluck('seo');

        $data = compact('jobs', 'categories', 'countries', 'seo');
        return view('pages.job.list')->with($data);