app/Models/Category.php

select count(*) as aggregate from `companies` where `companies`.`category_id` = 1 and `companies`.`category_id` is not null
select count(*) as aggregate from `products` where `products`.`category_id` = 6 and `products`.`category_id` is not null
---
    public function countItem($type): int
    {
        if ($type == 'company') {
            return $this->companies()->count();
        } elseif ($type == 'product') {
            return $this->products()->count();