app/Models/Company.php

select * from `rate_reviews` where `type` = 'company' and `item_id` = 11 limit 3 offset 9
select count(*) as aggregate from `rate_reviews` where `type` = 'company' and `item_id` = 11
---
    public function getReviews() : array | object
    {
        return RateReview::where('type', 'company')->where('item_id', $this->id)->paginate(3);