app/Models/Deal.php

select count(*) as aggregate from `rate_reviews` where `type` = 'deal' and `item_id` = 41
---
    public function getReviews() : array | object
    {
        return RateReview::where('type', 'deal')->where('item_id', $this->id)->paginate(3);