app/Models/Event.php

select * from `rate_reviews` where `type` = 'event' and `item_id` = 39 limit 3 offset 3
select count(*) as aggregate from `rate_reviews` where `type` = 'event' and `item_id` = 39
---
    public function getReviews() : array | object
    {
        return RateReview::where('type', 'event')->where('item_id', $this->id)->paginate(3);