app/Models/Forum.php

select count(*) as aggregate from `forum_replies` where `forum_replies`.`forum_id` = 1 and `forum_replies`.`forum_id` is not null
---
    public function countAnswers() : int
    {
        return $this->forumReplies()->count();