app/Models/Product.php

    public function getReviews(): array|object
    {
        return RateReview::where('type', 'product')->where('item_id', $this->id)->paginate(3);
---
select * from `rate_reviews` where `type` = 'product' and `item_id` = 108 limit 3 offset 0
select count(*) as aggregate from `rate_reviews` where `type` = 'product' and `item_id` = 108